{"101":{"Id":101,"url":"RWorldS/build_1_1","buildListId":1,"name":"住宅","des":"A common residential house. The residence will continue to increase over time after the construction is completed. It can accommodate a maximum of X residents. Upgrading dwellings will accommodate more residents."},"201":{"Id":201,"url":"RWorldS/build_1_1","buildListId":2,"name":"农田","des":"Fields planted with basic crops can produce basic food crops.\r\nFarmland is a production building, which requires labor and consuming fresh water to maintain operation. Unsupervised farmland cannot produce resources.\r\nUpgrading farmland can increase daily food production and output efficiency.\r\n* There is an upper limit on the daily output of production buildings. When the output resources reach the upper limit, the building will stop working and will not produce any more resources on that day."},"202":{"Id":202,"url":"RWorldS/build_1_1","buildListId":2,"name":"水井","des":"There is an upper limit on the daily output of production buildings. When the output resources reach the upper limit, the building will stop working and will not produce any more resources on that day."},"203":{"Id":203,"url":"RWorldS/build_1_1","buildListId":2,"name":"采矿场","des":"A simple mining facility that collects minerals from the surface.\r\nMining farms are production buildings and require labor to maintain operations. Unsupervised mining farms cannot produce resources.\r\nUpgrading mining farms can increase daily mineral production and output efficiency.\r\n* There is an upper limit on the daily output of production buildings. When the output resources reach the upper limit, the building will stop working and will not produce any more resources on that day."},"204":{"Id":204,"url":"RWorldS/build_1_1","buildListId":2,"name":"伐木场","des":"A simple logging building that collects nearby wood.\r\nLumber mills are production buildings and require a population to maintain operation. Unattended lumber mills cannot produce resources.\r\nUpgrading lumber mills can increase daily wood production and efficiency.\r\n*Production buildings have an upper limit on daily output. When the output resources reach the upper limit, the building will enter the resting phase and will not produce any more resources on that day."},"205":{"Id":205,"url":"RWorldS/build_1_1","buildListId":2,"name":"小型工厂","des":"A processing facility is used to produce nails.\r\nProcessing plants are production-oriented buildings and require a population to maintain operations, and unattended processing plants cannot produce resources.\r\nUpgrading the processing plant can increase the upper limit of the output and processing efficiency.\r\n* *Production buildings have an upper limit on daily output. When the output resources reach the upper limit, the building will enter the resting phase and will not produce any more resources on that day.\r\n\r\n"},"401":{"Id":401,"url":"RWorldS/build_1_1","buildListId":4,"name":"图书馆","des":"The library is a special facility for readers to use documents in the library. Please keep quiet in the library.\r\nThe library can generate research points by configuring the population, and research points can help you unlock more technologies in the research institute.\r\nUpgrading the library can increase the number of research points produced and the efficiency."},"402":{"Id":402,"url":"RWorldS/build_1_1","buildListId":4,"name":"研究院","des":"The Research Institute includes a variety of scientific research facilities for scientific research.\r\nNew technologies can be unlocked in the Research Institute, which requires you to meet certain conditions and consume a certain amount of research points to activate.\r\nOnly one Research Institute can be built per planet.\r\n\r\n"},"403":{"Id":403,"url":"RWorldS/build_1_1","buildListId":4,"name":"仓库","des":"The warehouse has an initial upper limit of slots, and each slot can store a certain amount of resources.\r\n*The warehouse is a storage-type building that can store various resources. By upgrading the warehouse, the upper limit of the slots and the resource stacks can be increased.\r\n"}}